Table of Contents
 Interface IIdeaResult
Namespace
IdeaStatiCa.BimApi.Results
Assembly
IdeaStatiCa.BimApi.dll
Result on IIdeaMember1D or IIdeaElement1D.
public interface IIdeaResult
Properties
 CoordinateSystemType
Type of the coordinate system the results are defined in.
ResultLocalSystemType CoordinateSystemType { get; }
Property Value
ResultLocalSystemType
 Sections
Sections with results.
IEnumerable<IIdeaSection> Sections { get; }
Property Value
IEnumerable<IIdeaSection>
 Edit this page